misc/registerUrlRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <ns2:RequestSOAPHeader xmlns:ns2="http://www.huawei.com.cn/schema/common/v2_1">
            <ns2:spId>881188</ns2:spId>
            <ns2:spPassword>NkY4M0VEODdCNjVBQ0I4MTE2QkNFMUI0NkQ1NDhCRkY0OTlBMzQwNkMzRDY1NTlFRjdCNEMwRjU1Qzc4MURBOQ==
            </ns2:spPassword>
            <ns2:serviceId>881188000</ns2:serviceId>
            <ns2:timeStamp>20170321114908</ns2:timeStamp>
        </ns2:RequestSOAPHeader>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns4:RequestMsg xmlns:ns2="http://api-v1.gen.mm.vodafone.com/mminterface/result"
                        xmlns:ns4="http://api-v1.gen.mm.vodafone.com/mminterface/request">
            <![CDATA[<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
            <request
                    xmlns="http://api-v1.gen.mm.vodafone.com/mminterface/request">
                <Transaction>
                    <CommandID>RegisterURL</CommandID>
                    <OriginatorConversationID>BSK--20170321114806361</OriginatorConversationID>
                    <Parameters>
                        <Parameter>
                            <Key>ResponseType</Key>
                            <Value>Completed</Value>
                        </Parameter>
                    </Parameters>
                    <ReferenceData>
                        <ReferenceItem>
                            <Key>ValidationURL</Key>
                            <Value>https://10.64.0.236:7022/mpesa/validate</Value>
                        </ReferenceItem>
                        <ReferenceItem>
                            <Key>ConfirmationURL</Key>
                            <Value>https://10.64.0.236:7022/mpesa/result</Value>
                        </ReferenceItem>
                    </ReferenceData>
                </Transaction>
                <Identity>
                    <Caller>
                        <CallerType>2</CallerType>
                        <ThirdPartyID></ThirdPartyID>
                        <Password></Password>
                        <CheckSum></CheckSum>
                        <ResultURL></ResultURL>
                    </Caller>
                    <Initiator>
                        <IdentifierType>11</IdentifierType>
                        <Identifier></Identifier>
                        <SecurityCredential></SecurityCredential>
                    </Initiator>
                    <PrimaryParty>
                        <IdentifierType>4</IdentifierType>
                        <Identifier></Identifier>
                        <ShortCode>531441</ShortCode>
                    </PrimaryParty>
                </Identity>
                <KeyOwner>1</KeyOwner>
            </request>
            ]]>
        </ns4:RequestMsg>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>